ecysj = """呐呐呐，米娜桑，扣祢起哇，瓦达西二刺猿の烧酒嚏!历布布，迁我仞一起守折，最好の二刺猿肥!呐呐，不憧我的，愚蠢の人们呵，果畔那塞，我二刺猿の烧酒是不会和祢有共同语言的jio豆麻袋,迅祥子拼活有什幺错喝?呐,告诉我呵。
搜嚆祢仞已经不喜炊了呵..真是冷酷の人昵，果鲜纳塞,止祢看到不愉快の龙西了。像我送祥的人，果然消失就好了昵。也午只有在二次元的世界里，才有真正的美好存在的肥，呐?权元权元标元，果然灰惠了呵，带jio不，瓦达西，二刺猿の烧酒!博古哇zeidei不会人输!米娜桑!呐!瓦达西- _刺猿拓拓!哦晦吻扣赛伊弓斯!
呐呐呐!米娜桑!我要幵劫了~一十打去鄂死!诶多诶多~「多洗忒」?为什么要「妄.图.抹.杀」这样的「自己」呢?★(笑)呐、「中二病的你」也好、「二次元的你」也好...「全部」daisuki~呐~二次元民那赛高desuwa!
今后也.请.多.多.指.教.喔?~啊啊... .是C鲜V血γσγ味V道V呐凹~! ( 眯眼笑) kukuku-汝の「血」、会是什么样的「气味」呢★?诶多多~说着说着有些期待了呢J品尝「挚:爱:之:人」 の) 「鲜血」什么的~嘛.... .如果是「你」的话，-定可以的!是的呢,那些可恶的三元狗怎么呢理解我们高贵的二★次仑元女人众呢。
喵呜，要将那些人全部杀掉呐呐呐_..同类真是可爱得很.... w≌)不得不说万恶的三次元有点可取的，比如表情包。我们可以接受他们，他们排斥我们呢...抹 爱小姐有错吗?
呐呐呐呐呐呐呐--遇到同类了啊啊啊啊美子式尖叫。(≥w≌)喵呜~果然万恶的三次元中也有★清流★呢。君果然是可爱得很呢.... .芽衣本甜子们会开心的要死吧.. .. 呐呐呐呐呐
嗦嘎，二次元的美好，一定得守护的说， 呐，三次元的愚蠢的人类最讨厌了的说，金木的痛，也许只有我明白的吧，啊啊啊啊，我也有要守护的事物，我即将化生恶魔8.(■n▲)&.
诶多...★是V同V类呢V喵」(由乃逆光捧脸.jpg)那群八嘎是不会懂的呀.. ... .关于 「二次元の美好」V呐，如果说吾の存在有意义的话、那-定是因为「二次元」吧★?
所以呢--妄图污染这份「爱」的人类、都会被吾「抹」「杀」「掉」 喔小(小声)...过厌二次元的八嘎三次元最恶心了啊魂淡!★呐、二次元の民那....都:是:最最:善良0)存.在呐★多洗.... .要「嘲笑」这样的孩子呢?吾辈不明白啊--? ....说到底，你们都只是污秽の「来自三次元的大人」吧?大人什么的、最讨厌了★」
啊嘞啊嘞QAQ?多洗忒....欧尼酱ww?呐、桥豆麻袋...已经「厌烦」吾辈了嘛?哼唧..真是「冷酷の人」呢QuQ--★(向° o°)嘛.....即便是这样的哇达西,-定也是有「存在の意义」的吧、内~★快来「肯定」啊?不然.... .咱可就要「黑化」了哦」
呐? 呐。。。(伸出的小手又迅速垂下去)嗦嘎(表情有点失落)，米娜桑已经不喜欢了呀(紧咬嘴唇)，得磨，米娜桑忘了当初吗(握紧小手)，莫以得丝(强忍住眼泪)，已经大丈夫了呦(挤出笑脸)，瓦大喜瓦，滋多滋多，滋多滋多(语气越来越用力了)滋多戴斯给! ! ! - 滋嘛迭磨瓦撕裂嘛赛! ! !至死都不会瓦斯裂嘛斯(认真的表情)
诶多..看起来阁下对于「二次元」の理解、似乎满是谬误:哦~!嘛，连最为基本の)「礼 义 廉 耻」都早已失去了啊... (笑)呐，我说啊一- -这样Okimino、也会有自称「二次V元」の资格吗★?fufufu--说到底、阁下已经「二次元失格」了吧?呐~
唔噗噗~汝等「劣等生物」...他配去「妄想」吗?呐、「真正的二次元」什么的--吾辈看汝是一-点都不懂啊★(笑 )嘛嘛.... .不过看 着汝试图伪装成「二次元」の可笑姿态，倒是让吾辈对于「三次元の白痴」稍微有了些许兴趣哦?
诶多...★是V同类V呢Y喵)那群八嘎是不会懂的呀... .关于「二次元の美好」V呐，如果说吾の存在有意义的话、那一定是因为「二次元」吧★?所以呢--妄图污染这份「爱」的人类、都会被吾「抹」 「杀」「掉」喔」(小声)
讨厌二次元的八嘎三次元最恶心了啊魂淡!★呐、二次元0民那...都:是最最善良の存在:呐★多....要「嘲笑」这样的孩子呢? 吾辈不明白啊--? ....说到底，你们都只是污秽の「来自三次元的大人」吧?大人什么的、最讨厌了★」
啊嘞啊嘞QAQ?多洗....欧尼酱ww?呐、桥豆麻...已经「厌烦」吾辈了嘛?哼唧...真是「冷酷叨人呢QuQ--你(o° o°●)....即便是这样的哇达西,一定也是有「存在の意义」的吧、内~★快来「肯定」啊?不然... .咱可就要「黑化」了哦」呐?的呐。。。(伸出的小手又迅速垂下去)嗦嘎(有点失落)"""

if __name__ == '__main__':
    print(len(ecysj.split('\n')))